[
    {
        "link": "brain",
        "title": "Ideas Identify",
        "subtitle": "subtitle",
        "client": "TechTatva '14'",
        "desc": "TechTatva is the annual technical festival, organized by my college. This was initally intended for the fest's tshirt. Unfortunately, it was rejected. <br/><br/>This project will always have a special place in my heart, because I remember modelling the brain in 3ds Max first, then rendering it out and tracing it in illustrator.<br/><br/>Fun Fact: I had this idea in a dream.",
        "tools": ["Adobe Illustrator", "3ds Max"],
        "location": "/img/work/brain.png"
    },
    {
        "link": "pizza",
        "title": "Pizza Secrets",
        "subtitle": "subtitle",
        "client": "Dribbble Invite",
        "desc": "This was a little project I did for a dribbble invite competition. <br/>The rules were simple, upload an illustration of your favourite food, and I'm a sucker for pizzas. <br/><br/>I felt this was my time to put in a lot of detail and thought into a project, something I was learning to appreciate.",
        "tools": ["Adobe Illustrator"],
        "location": "/img/work/pizza.png"
    },
    {
        "link": "internals",
        "title": "iPhone Internals",
        "subtitle": "subtitle",
        "client": "Cryptophoto",
        "desc": "A friend of mine got this project where he had to illustrate bugs in hardware. So I whipped up this baby. <br/><br/>I looked at a lot of electrical components online, then isolated myself for a day, and out came this beauty.<br/><br/>Fun Fact: I just had to deliver the final illustration. The animation was done because I HAD to.",
        "tools": ["Adobe Illustrator","Adobe After Effects"],
        "location": "/img/work/internals.gif"
    },
    {
        "link": "phoenix",
        "title": "RISE.",
        "subtitle": "subtitle",
        "client": "Self Project",
        "desc": "Another one of those self-motivated projects, this was intended intially for my father's office. It ended up looking way too artistic for a professor, but I finished it anyway, because I was starting to fall in love with this.<br/><br/>Fun Fact: This was featured on Pantone Canvas",
        "tools": ["Adobe Illustrator"],
        "location": "/img/work/phoenix.png"
    },
    {
        "link": "heart",
        "title": "Mechanical Feelings",
        "subtitle": "subtitle",
        "client": "TechTatva '14'",
        "desc": "TechTatva is the annual technical festival, organized by my college. Me and a friend, we were Graphic Design Coorinators for the fest. We had this idea of making low-poly style illustrations for all posters.<br/><br/>This was an illustration for one of those. The Biomedical category, to be precise. <br/><br/> Fun Fact: Every triangle in that image is hand-drawn, and took a total of about 6 hours.",
        "tools": ["Adobe Illustrator","Adobe Photoshop"],
        "location": "/img/work/heart.png"
    },
    {
        "link": "anarchy",
        "title": "Anarchy",
        "subtitle": "subtitle",
        "client": "Self Project",
        "desc": "I dig minimalism. The idea of communicating with as little as possible amazes me. LEGO amazes me too. <br /><br />Hence.<br /><br />Fun Fact: I had this idea sitting in class.",
        "tools": ["Adobe Illustrator"],
        "location": "/img/work/anarchy.png"
    },
    {
        "link": "construction",
        "title": "Under Construction",
        "subtitle": "subtitle",
        "client": "Self Project",
        "desc": "I've seen some beautiful 'Under Construction' pages. When I started building my website, I felt I HAD to have a pretty 'Return later' page. <br /><br/>This was the result of a late night design marathon. I looked at a lot of construction equipment online, and then got to work.<br/><br/>Fun Fact: This was only up for a week or so.",
        "tools": ["Adobe Illustrator"],
        "location": "/img/work/construction.png"
    },
    {
        "link": "anatomy",
        "title": "Anatomy of LEGO Block",
        "subtitle": "subtitle",
        "client": "Self Project",
        "desc": "Remember that 'Anarchy' project? I liked that LEGO block so much, I illustrated its bottom. Of course, what project is complete without unnecesssary labelling to make it look complicated?<br/><br/>Fun Fact: This project had no thought put into it AT ALL.",
        "tools": ["Adobe Illustrator"],
        "location": "/img/work/anatomy.png"
    },
    {
        "link": "zuckerberg",
        "title": "Mark Zuckerberg",
        "subtitle": "subtitle",
        "client": "TechTatva '14'",
        "desc": "TechTatva is the annual technical festival, organized by my college. Me and a friend, we were Graphic Design Coorinators for the fest. We had this idea of making low-poly style illustrations for all posters.<br/><br/>This was an illustration for one of those. The Computer Science category, to be precise. <br/><br/> Fun Fact: Every triangle in that image is hand-drawn, and took a total of about 4 hours.",
        "tools": ["Adobe Illustrator"],
        "location": "/img/work/zuckerberg.png"
    },
    {
        "link": "polymer",
        "title": "Polymer King",
        "subtitle": "subtitle",
        "client": "Google Developers' Group, Manipal",
        "desc": "Google Developers' Group, Manipal organized a workshop on Polymer and Material Design. They needed a poster that was well designed and attracted attention. I was obsessed with overly complicated badge designs at that time. Unfortuanetly, I did not have enough time to detail it to my heart's content.<br/><br/>Fun Fact: I organized & taught that workshop.",
        "tools": ["Affinity Designer"],
        "location": "/img/work/polymer.png"
    },
    {
        "link": "camera",
        "title": "InstaCam",
        "subtitle": "subtitle",
        "client": "Google Developers' Group, Manipal",
        "desc": "Google Developers' Group, Manipal organized a 'Selfie Week' in my college. They needed a poster that related to the subject, and what better way to put that forward than a classic Polaroid camera? <br /><br />Fun Fact: This was done in the library in 2 hours, no planning, no sketching, just me and that canvas.",
        "tools": ["Affinity Designer"],
        "location": "/img/work/camera.png"
    },
    {
        "link": "intro",
        "title": "IE CSE Intro",
        "subtitle": "subtitle",
        "client": "IE CSE, Manipal",
        "desc": "IE CSE is the official Computer Science club of my college. This was done as an intro for their annual General Body Meeting. <br /><br />This little baby was my first shot at frame-by-frame animation<br/><br/>I had recently come across this concept of drawing each frame manually in an animation, and I was amazed. I had to try it for myself. So I grabbed my tablet and got to work!",
        "tools": ["Adobe Photoshop", "Adobe After Effects"],
        "location": "/img/work/clubintro.gif"
    }
]
