{
  "title": "Experience",
  "companies": [{
    "title": "Postman",
    "years": "2016-2018",
    "website": {
      "link": "https://getpostman.com",
      "label": "getpostman.com"
    },
    "text": [
      "Postman’s app is a web developer’s best friend. It is an irreplaceable toolchain for working with APIs.",
      "A fresh college graduate, I was looking for a place that would let me have an impact. I interned here for 6 months, and was ultimately hired as a third to the small team of engineers that built and maintained the Postman app. This meant writing a ton of JavaScript, support on GitHub issues and a lot of mistakes. A lot. It was glorious. During my time here, I modernized the Collection Runner’s UI and underlying data model (which is just fancy-talk for a rewrite). I also got to work with a brilliant team as we rewrote huge parts of the app to support Workspaces within the app.",
      "Tech I used to get my job done:"
    ],
    "tech": [
      "Electron",
      "Webpack (back in my day, we configured it ourselves. Then the `create-react-app` nation attacked)",
      "React",
      "Redux & MobX",
      "Mocha & Selenium (sounds like a poisonous beverage, but they saved our butts multiple times)",
      "SCSS (the love of my life)"
    ]
  }, {
    "title": "Perdoo",
    "years": "2018-2019",
    "website": {
      "link": "https://perdoo.com",
      "label": "perdoo.com"
    },
    "text": [
      "Perdoo is the OKR tool for champions. It is a management tool companies use to reach their visions and goals.",
      "I moved to Berlin to join Perdoo. A young programmer out to face the world. Magical 🌈. I was brought on to maintain their entire UI library and their web dashboard. I introduced Storybook to the UI library and refactored old components to be more reusable (and pretty!). We also ported legacy code over to have a more linear (read, predictable) data flow. Ended up crushing the number of monthly bug reports to half of what it was! We had a React Native app that was built by a freelancer before me, but I took that over, just because I loved the code they’d written.",
      "Tech I used to make the big bucks:"
    ],
    "tech": [
      "React",
      "Redux",
      "React Native (Don't tell SCSS but I have a crush on RN)",
      "Mocha, Jest & Enzyme"
    ]
  }]
}